Repository: yiisoft/docs
Catalog: _translations/cookbook/po/*/sentry-integration.md.po
Languages: ru

source: Sentry integration
ru: Интеграция с Sentry

source: What is Sentry
ru: Что такое Sentry

source: [Sentry](https://sentry.io/) is a tool for monitoring and debugging application stability and performance. Sentry gives you access to the events that you send there from your application.
ru: [Sentry](https://sentry.io/) – это инструмент мониторинга и отладки производительности и стабильности. Sentry представляет доступ к событиям, которые вы отправите туда из вашего приложения.

source: Most often, Sentry is used for monitoring errors (exceptions). You can enrich errors with context to better understand the problem: - Request arguments - Tags for grouping exceptions - Environment state: environment variables, application state, and other global attributes
ru: Чаще всего Sentry используется для мониторинга ошибок (исключений). Ошибки можно "обогатить" контекстом для лучшего понимания вызванной проблемы: - Аргументы, с которыми вызывалось приложение - Теги, для группировки исключений - Состояние среды окружения: переменные окружения, состояние приложения и прочие "глобальные" аттрибуты

source: You can find the full list of features on the official website: https://sentry.io/welcome/
ru: Полный список всех возможностей можно найти на официальном сайте: https://sentry.io/welcome/

source: Installation
ru: Установка

source: Install the package
ru: Установка пакета

source: Install the required package `yiisoft/yii-sentry` with the following command:
ru: Для установки нужного пакета установите пакет `yiisoft/yii-sentry` следующей командой:

source: Install an HTTP driver
ru: Установка HTTP-драйвера

source: The [`getsentry/sentry-php`](https://github.com/getsentry/sentry-php) library requires the `php-http/httplug` package and any HTTP driver. In the example below we’ll use the Guzzle adapter.
ru: Библиотека [`getsentry/sentry-php`](https://github.com/getsentry/sentry-php) требует установки `php-http/httplug` пакета и любого HTTP-драйвера. Для примеры используется адаптер `Guzzle`.

source: > You can find the list of all adapters on [this page](https://docs.php-http.org/en/latest/clients.html#clients-adapters).
ru: > Список всех адаптеров можно найти на [этой](https://docs.php-http.org/en/latest/clients.html#clients-adapters) странице.

source: To install the packages, run the following command:
ru: Для установки пакетов выполните в консоли следующую команду:

source: Configuration
ru: Настройка

source: Get and store the token
ru: Получение и сохранение токена

source: Next, configure the application.
ru: Далее сконфигурируем приложение.

source: First, register at [Sentry](https://sentry.io) and create a project.
ru: Для начала зарегистрируйтесь в [Sentry](https://sentry.io) и создайте проект.

source: Then, in the project settings on the “General Settings” tab, find the “Security Token” field and copy its value.
ru: Далее в настройках проекта, на вкладке `General Settings`, найдите поле `Security Token` и скопируйте оттуда значение.

source: Now put this token into the package configuration. By default, the config is located at `config/packages/yiisoft/yii-sentry/config/params.php`. Set the copied token as the value of the array element at `yiisoft/yii-sentry` => `options` => `dsn`. Example:
ru: Теперь положите этот токен в настройки пакета. По умолчанию конфиг лежит в `config/packages/yiisoft/yii-sentry/config/params.php`. Скопированный токен запишите в значение элемента массива по ключу `yiisoft/yii-sentry` => `options` => `dsn`. Пример:

source: 'yiisoft/yii-sentry' => [ 'enabled' => true, 'options' => [ - 'dsn' => '', + 'dsn' => 'TOKEN', ], ],
ru: 'yiisoft/yii-sentry' => [ 'enabled' => true, 'options' => [ - 'dsn' => '', + 'dsn' => 'ТОКЕН', ], ],

source: Configure the HTTP client
ru: Настройка HTTP-клиента

source: After installing the HTTP client, configure it.
ru: После установки HTTP-клиента, сконфигурируйте его.

source: Create the file `config/common/sentry.php` and put the following code into it:
ru: Создайте файл `config/common/sentry.php` и положите в него следующий код:

source: Integration
ru: Интеграция

source: Web
ru: Веб

source: Sentry support for `web` is implemented as middleware.
ru: Поддержка Sentry для `web` реализована как `middleware`.

source: That means you only need to add `SentryMiddleware` to the global middleware list in `config/web/application.php`:
ru: А это значит, что достаточно будет добавить `SentryMiddleware` в глобальный список `middleware` в `config/web/application.php`:

source: Console
ru: Консоль

source: Sentry supports `console` via a handler for the [ConsoleEvents::ERROR](https://symfony.com/doc/current/components/console/events.html#the-consoleevents-error-event) event.
ru: Sentry поддерживает `console` в виде обработчика события [ConsoleEvents::ERROR](https://symfony.com/doc/current/components/console/events.html#the-consoleevents-error-event).

source: The package provides a configuration file that automatically subscribes the application to this event.
ru: Пакет предоставляет конфигурационный файл, который автоматически подписывает приложение на это событие.
