Repository: yiisoft/docs
Catalog: _translations/guide/po/*/caching_data.md.po
Languages: id

source: Data caching
id: Caching data

source: Data caching is about storing some PHP variables in a cache and retrieving them later from the cache. It's also the foundation for more advanced caching features, such as [page caching](page.md).
id: Caching data adalah tentang menyimpan beberapa variabel PHP ke dalam cache dan mengambilnya kembali dari cache. Ini juga menjadi fondasi untuk fitur caching yang lebih lanjut, seperti [caching halaman](page.md).

source: To use cache, install [yiisoft/cache](https://github.com/yiisoft/cache) package:
id: Untuk menggunakan cache, pasang paket [yiisoft/cache](https://github.com/yiisoft/cache):

source: The following code is a typical usage pattern of data caching, where `$cache` refers to a `Cache` instance from the package:
id: Kode berikut adalah pola penggunaan umum caching data, di mana `$cache` merujuk ke instance `Cache` dari paket tersebut:

source: When cache has data associated with the `$key`, it returns the cached value. Otherwise, it executes the passed anonymous function to calculate the value to cache and return.
id: Ketika cache memiliki data yang terkait dengan `$key`, ia akan mengembalikan nilai yang di-cache. Jika tidak, ia akan mengeksekusi fungsi anonim yang diberikan untuk menghitung nilai yang akan di-cache dan dikembalikan.

source: If the anonymous function requires some data from the outer scope, you can pass it with the `use` statement.
id: Jika fungsi anonim membutuhkan beberapa data dari scope luar, Anda dapat meneruskannya menggunakan pernyataan `use`.

source: The cache service uses [PSR-16](https://www.php-fig.org/psr/psr-16/) compatible cache handlers which represent various cache storages, such as memory, files, and databases.
id: Layanan cache menggunakan handler cache yang kompatibel dengan [PSR-16](https://www.php-fig.org/psr/psr-16/) yang merepresentasikan berbagai penyimpanan cache, seperti memori, berkas, dan basis data.

source: Yii provides the following handlers:
id: Yii menyediakan handler berikut:

source: `NullCache` — a cache placeholder which does no real caching. The purpose of this handler is to simplify the code that needs to check the availability of cache. For example, during development or if the server doesn't have actual cache support, you may configure a cache service to use this handler. When you enable actual cache support, you can switch to using the corresponding cache handler. In both cases, you may use the same code without extra checks.
id: `NullCache` — placeholder cache yang tidak melakukan caching nyata. Tujuan handler ini adalah menyederhanakan kode yang perlu memeriksa ketersediaan cache. Misalnya, selama pengembangan atau jika server tidak memiliki dukungan cache, Anda dapat mengonfigurasi layanan cache untuk menggunakan handler ini. Saat Anda mengaktifkan dukungan cache nyata, Anda dapat beralih menggunakan handler cache yang sesuai. Pada kedua kasus, Anda dapat menggunakan kode yang sama tanpa pemeriksaan tambahan.

source: `ArrayCache` — provides caching for the current request only by storing the values in an array.
id: `ArrayCache` — menyediakan caching hanya untuk permintaan saat ini dengan menyimpan nilai dalam sebuah array.

source: [APCu](https://github.com/yiisoft/cache-apcu) - uses a PHP [APC](https://secure.php.net/manual/en/book.apc.php) extension. You can consider this option as the fastest one when dealing with cache for a centralized thick application (e.g., one server, no dedicated load balancers, etc.).
id: [APCu](https://github.com/yiisoft/cache-apcu) — menggunakan ekstensi PHP [APC](https://secure.php.net/manual/en/book.apc.php). Ini bisa dianggap sebagai opsi tercepat saat berurusan dengan cache untuk aplikasi terpusat (mis., satu server, tanpa load balancer khusus, dll.).

source: [Database](https://github.com/yiisoft/cache-db) — uses a database table to store cached data.
id: [Database](https://github.com/yiisoft/cache-db) — menggunakan tabel basis data untuk menyimpan data yang di-cache.

source: [File](https://github.com/yiisoft/cache-file) — uses standard files to store cached data. This is particularly suitable to cache large chunks of data, such as page content.
id: [File](https://github.com/yiisoft/cache-file) — menggunakan berkas standar untuk menyimpan data yang di-cache. Ini sangat cocok untuk menyimpan potongan data besar, seperti konten halaman.

source: [You could find more handlers at packagist.org](https://packagist.org/providers/psr/simple-cache-implementation).
id: [Anda dapat menemukan lebih banyak handler di packagist.org](https://packagist.org/providers/psr/simple-cache-implementation).

source: > [!TIP] > You may use different cache storage in the same application. A common strategy is: > - To use memory-based cache storage to store small but constantly used data (e.g., statistics) > - To use file-based or database-based cache storage to store big and less often used data (e.g., page content)
id: > [!TIP] > Anda dapat menggunakan penyimpanan cache yang berbeda dalam aplikasi yang sama. Strategi umum adalah: > - Gunakan penyimpanan cache berbasis memori untuk menyimpan data kecil tetapi sering digunakan (mis., statistik) > - Gunakan penyimpanan cache berbasis berkas atau basis data untuk menyimpan data besar dan jarang digunakan (mis., konten halaman)

source: Cache handlers are usually set up in a [dependency injection container](../concept/di-container.md) so that they can be globally configurable and accessible.
id: Handler cache biasanya disetel dalam [dependency injection container](../concept/di-container.md) sehingga dapat dikonfigurasi dan diakses secara global.

source: Because all cache handlers support the same set of APIs, you can swap the underlying cache handler with a different one. You can do it by reconfiguring the application without modifying the code that uses the cache.
id: Karena semua handler cache mendukung kumpulan API yang sama, Anda dapat menukar handler cache yang digunakan dengan yang lain. Anda dapat melakukannya dengan mengonfigurasi ulang aplikasi tanpa mengubah kode yang menggunakan cache.

source: A key uniquely identifies each data item stored in the cache. When you store a data item, you have to specify a key for it. Later, when you retrieve the data item, you should give the corresponding key.
id: Sebuah kunci mengidentifikasi secara unik setiap item data yang disimpan di cache. Saat Anda menyimpan sebuah item data, Anda harus menentukan kunci untuknya. Nantinya, ketika Anda mengambil item data tersebut, Anda perlu memberikan kunci yang sesuai.

source: You may use a string or an arbitrary value as a cache key. When a key isn't a string, it will be automatically serialized into a string.
id: Anda dapat menggunakan string atau nilai arbitrer sebagai kunci cache. Ketika kunci bukan string, ia akan diserialisasi menjadi string secara otomatis.

source: A common strategy of defining a cache key is to include all determining factors in terms of an array.
id: Strategi umum dalam mendefinisikan kunci cache adalah menyertakan semua faktor penentu dalam bentuk array.

source: When different applications use the same cache storage, you should specify a unique cache key prefix for each application to avoid conflicts of cache keys. You can do this by using `\Yiisoft\Cache\PrefixedCache` decorator:
id: Ketika aplikasi yang berbeda menggunakan penyimpanan cache yang sama, Anda harus menentukan prefiks kunci cache yang unik untuk setiap aplikasi guna menghindari konflik kunci cache. Anda dapat melakukannya dengan menggunakan dekorator `\Yiisoft\Cache\PrefixedCache`:

source: A data item stored in a cache will remain there forever unless it's removed because of some caching policy enforcement. For example, caching space is full and cache storage removes the oldest data. To change this behavior, you can set a TTL parameter when calling a method to store a data item:
id: Item data yang disimpan di cache akan tetap di sana selamanya kecuali dihapus karena beberapa kebijakan caching. Misalnya, ruang cache penuh dan penyimpanan cache menghapus data tertua. Untuk mengubah perilaku ini, Anda dapat menyetel parameter TTL saat memanggil metode untuk menyimpan item data:

source: The `$ttl` parameter indicates for how many seconds the data item can remain valid in the cache. When you retrieve the data item, if it has passed the expiration time, the method will execute the function and set the resulting value into cache.
id: Parameter `$ttl` menunjukkan berapa detik item data dapat tetap valid di cache. Ketika Anda mengambil item data tersebut, jika waktu kedaluwarsanya telah lewat, metode akan mengeksekusi fungsi dan menyetel nilai yang dihasilkan ke dalam cache.

source: Additionally, you can invalidate a cache key explicitly:
id: Selain itu, Anda dapat menginvalidasi kunci cache secara eksplisit:

source: Besides the expiration setting, changes of the so-called **invalidation dependencies** may also invalidate cached data item. For example, `\Yiisoft\Cache\Dependency\FileDependency` represents the dependency of a file's modification time. When this dependency changes, it means something modifying the corresponding file. As a result, any outdated file content found in the cache should invalidate.
id: Selain pengaturan kedaluwarsa, perubahan pada yang disebut sebagai **ketergantungan invalidasi** juga dapat menginvalidasi item data yang di-cache. Misalnya, `\Yiisoft\Cache\Dependency\FileDependency` merepresentasikan ketergantungan pada waktu modifikasi sebuah berkas. Ketika ketergantungan ini berubah, itu berarti ada sesuatu yang memodifikasi berkas terkait. Akibatnya, konten berkas yang usang yang ditemukan di cache harus diinvalidasi.

source: Cache dependencies are objects of `\Yiisoft\Cache\Dependency\Dependency` descendant classes. When you store a data item in the cache, you can pass along an associated cache dependency object. For example,
id: Ketergantungan cache adalah objek dari kelas turunan `\Yiisoft\Cache\Dependency\Dependency`. Ketika Anda menyimpan sebuah item data ke cache, Anda dapat menyertakan objek ketergantungan cache terkait. Contohnya,

source: Below is a summary of the available cache dependencies:
id: Berikut ringkasan ketergantungan cache yang tersedia:

source: `\Yiisoft\Cache\Dependency\ValueDependency`: invalidates the cache when specified value changes.
id: `\Yiisoft\Cache\Dependency\ValueDependency`: menginvalidasi cache ketika nilai yang ditentukan berubah.

source: `\Yiisoft\Cache\Dependency\CallbackDependency`: invalidates the cache when the result of the specified PHP callback is different.
id: `\Yiisoft\Cache\Dependency\CallbackDependency`: menginvalidasi cache ketika hasil dari callback PHP yang ditentukan berbeda.

source: `\Yiisoft\Cache\Dependency\FileDependency`: invalidates the cache when the file's last modification time is different.
id: `\Yiisoft\Cache\Dependency\FileDependency`: menginvalidasi cache ketika waktu modifikasi terakhir berkas berbeda.

source: `\Yiisoft\Cache\Dependency\TagDependency`: associates a cached data item with one or many tags. You may invalidate the cached data items with the specified tag(s) by calling `TagDependency::invalidate()`.
id: `\Yiisoft\Cache\Dependency\TagDependency`: mengaitkan item data yang di-cache dengan satu atau banyak tag. Anda dapat menginvalidasi item data yang di-cache dengan tag tertentu dengan memanggil `TagDependency::invalidate()`.

source: You may combine many dependencies using `\Yiisoft\Cache\Dependency\AnyDependency` or `\Yiisoft\Cache\Dependency\AllDependencies`.
id: Anda dapat mengombinasikan banyak ketergantungan menggunakan `\Yiisoft\Cache\Dependency\AnyDependency` atau `\Yiisoft\Cache\Dependency\AllDependencies`.

source: To implement your own dependency, extend from `\Yiisoft\Cache\Dependency\Dependency`.
id: Untuk mengimplementasikan ketergantungan Anda sendiri, turunkan dari `\Yiisoft\Cache\Dependency\Dependency`.

source: [A cache stampede](https://en.wikipedia.org/wiki/Cache_stampede) is a type of cascading failure that can occur when massively parallel computing systems with caching mechanisms come under a high load. This behavior is sometimes also called dog-piling.
id: [Cache stampede](https://en.wikipedia.org/wiki/Cache_stampede) adalah jenis kegagalan berantai yang dapat terjadi ketika sistem komputasi paralel masif dengan mekanisme cache berada di bawah beban tinggi. Perilaku ini terkadang juga disebut dog-piling.
