Repository: yiisoft/docs
Catalog: _translations/guide/po/*/README.md.po
Languages: es

source: The definitive guide to Yii 3.0
es: La Guía Definitiva de Yii 3.0

source: We release this guide under the [Terms of Yii Documentation](https://www.yiiframework.com/license#docs).
es: Esta guía se publica bajo los [Términos de documentación de Yii](https://www.yiiframework.com/license#docs)).

source: Introduction +
es: Introducción

source: [About Yii](intro/what-is-yii.md) +
es: [Acerca de Yii](intro/what-is-yii.md)

source: [Upgrading from version 2.0](intro/upgrade-from-v2.md) +
es: [Actualizar desde la Version 2.0](intro/upgrade-from-v2.md)

source: Getting started -
es: Primeros Pasos

source: [What do you need to know?](start/prerequisites.md) +
es: [Qué Necesitas Saber](start/prerequisites.md)

source: [Running applications](start/workflow.md) +
es: [Ejecutando Aplicaciones](start/workflow.md)

source: [Saying hello](start/hello.md) +
es: [Hola Mundo](start/hello.md)

source: [Working with forms](start/forms.md) +
es: [Trabajar con Formularios](start/forms.md)

source: [Working with databases](start/databases.md) !
es: [Trabajar con Bases de Datos](start/databases.md)

source: [Generating code with Gii](start/gii.md) -
es: [Generación de Código con Gii](start/gii.md)

source: [Looking ahead](start/looking-ahead.md) +
es: [Adentrarse en Yii](start/looking-ahead.md)

source: Application structure +
es: Estructura De Una Aplicación

source: [Application structure overview](structure/overview.md) +
es: [Información General de Estructura de Una Aplicación](structure/overview.md)

source: [Entry scripts](structure/entry-script.md) +
es: [Scripts de Entrada](structure/entry-script.md)

source: [Application](structure/application.md) +
es: [Applicación](structure/application.md)

source: [Service components](structure/service.md) +
es: [Componentes de Servicios](structure/service.md)

source: [Actions](structure/action.md) +
es: [Acciones](structure/action.md)

source: [Domain](structure/domain.md) +
es: [Dominio](structure/domain.md)

source: [Middleware](structure/middleware.md) +
es: [Lógica de Intercambio (middleware)](structure/middleware.md)

source: [Packages](structure/package.md) +
es: [Paquetes](structure/package.md)

source: Key concepts +
es: Conceptos Clave

source: [Class autoloading](concept/autoloading.md) +
es: [Autocarga de Clases (Autoloading)](concept/autoloading.md)

source: [Dependency injection container](concept/di-container.md) +
es: [Contenedor de Inyección de Dependencia](concept/di-container.md)

source: [Configuration](concept/configuration.md) +
es: [Configuración](concept/configuration.md)

source: [Aliases](concept/aliases.md) +
es: [Alias](concept/aliases.md)

source: [Events](concept/events.md) +
es: [Eventos](concept/events.md)

source: Handling requests +
es: Gestión de las Peticiones

source: [Routing and URL generation](runtime/routing.md) +
es: [Enrutamiento y Creación de las URL](runtime/routing.md)

source: [Request](runtime/request.md) +
es: [Peticiones (Requests)](runtime/request.md)

source: [Response](runtime/response.md) +
es: [Respuestas (Responses)](runtime/response.md)

source: [Sessions](runtime/sessions.md) +
es: [Sesiones (Sessions)](runtime/sessions.md)

source: [Handling errors](runtime/handling-errors.md) +
es: [Manejo de Errores](runtime/handling-errors.md)

source: [Logging](runtime/logging.md) +
es: [Registros (logs)](runtime/logging.md)

source: Working with databases +-
es: Trabajar con Bases de Datos

source: [Database access objects](db-dao.md): Connecting to a database, basic queries, transactions, and schema manipulation
es: [Objeto de Acceso a Datos](db-dao.md): Conexión a una base de datos, consultas básicas, transacciones y manipulación de esquemas

source: [Query builder](db-query-builder.md): Querying the database using a simple abstraction layer
es: [Constructor de Consultas](db-query-builder.md): Consulta de la base de datos utilizando una capa simple de abstracción

source: [Active record](db-active-record.md): The Active Record ORM, retrieving and manipulating records, and defining relations
es: [Active Record](db-active-record.md): ORM Active Record, recuperación y manipulación de registros y definición de relaciones

source: [Migrations](databases/db-migrations.md): +
es: [Migraciones](db-migrations.md)

source: Getting data from users -
es: Obtener Datos de los Usuarios

source: [Creating forms](input/forms.md) -
es: [Crear Formularios](input/forms.md)

source: [Validating input](https://github.com/yiisoft/validator/blob/master/docs/guide/en/README.md) +
es: [Validar Datos](https://github.com/yiisoft/validator/blob/master/docs/guide/en/README.md)

source: [Uploading files](input/file-upload.md) -
es: [Carga de Archivos](input/file-upload.md)

source: [Collecting tabular input](input/tabular-input.md) -
es: [Obtener Datos de Formularios Tabulados (Tabular Input)](input/tabular-input.md)

source: Displaying data -
es: Visualizar Datos

source: [Data formatting](output/formatting.md) -
es: [Formato de Datos](output/formatting.md)

source: [Pagination](output/pagination.md) -
es: [Paginación](output/pagination.md)

source: [Sorting](output/sorting.md) -
es: [Ordenamiento](output/sorting.md)

source: [Data providers](output/data-providers.md) -
es: [Proveedores de Datos](output/data-providers.md)

source: [Data widgets](output/data-widgets.md) -
es: [Widgets de Datos](output/data-widgets.md)

source: Security +-
es: Seguridad

source: [Security overview](security/overview.md) +
es: [Información General de Seguridad](security/overview.md)

source: [Authentication](security/authentication.md) +
es: [Autenticación](security/authentication.md)

source: [Authorization](security/authorization.md) +-
es: [Autorización](security/authorization.md)

source: [Working with passwords](security/passwords.md) +
es: [Trabajar con Contraseñas](security/passwords.md)

source: [Cryptography](security/cryptography.md) +
es: [Criptografía](security/cryptography.md)

source: [Best practices](security/best-practices.md) +
es: [Buenas Prácticas](security/best-practices.md)

source: Caching +-
es: Caché

source: [Caching overview](caching/overview.md) +
es: [Información General de Caché](caching/overview.md)

source: [Data caching](caching/data.md) +
es: [Caché de Datos](caching/data.md)

source: [Fragment caching](caching/fragment.md) -
es: [Caché de Fragmentos](caching/fragment.md)

source: [Page caching](caching/page.md) -
es: [Caché de Páginas](caching/page.md)

source: [HTTP caching](caching/http.md) -
es: [Caché HTTP](caching/http.md)

source: [Quick start](rest/quick-start.md)
es: [Inicio Rápido](rest/quick-start.md)

source: [Resources](rest/resources.md)
es: [Recursos](rest/resources.md)

source: [Controllers](rest/controllers.md)
es: [Controladores](rest/controllers.md)

source: [Routing](rest/routing.md)
es: [Enrutamiento](rest/routing.md)

source: [Authentication](rest/authentication.md)
es: [Autentificación](rest/authentication.md)

source: [Rate limiting](rest/rate-limiting.md)
es: [Límite de Solicitudes por Cliente (Rate Limiting)](rest/rate-limiting.md)

source: [Versioning](rest/versioning.md)
es: [Gestión de Versiones](rest/versioning.md)

source: [Error handling](rest/error-handling.md)
es: [Manejo de Errores](rest/error-handling.md)

source: Development tools -
es: Herramientas de Desarrollo

source: Debug toolbar and debugger
es: Depurador y Barra de Herramientas de Depuración

source: Generating code using Gii
es: Generación de Código con Gii

source: Generating API documentation
es: Generación de Documentación de API

source: Testing -
es: Pruebas (Testing)

source: [Testing overview](testing/overview.md)
es: [Información General de Pruebas](testing/overview.md)

source: [Testing environment setup](testing/environment-setup.md)
es: [Configuración del Entorno de Pruebas](testing/environment-setup.md)

source: [Unit tests](testing/unit.md)
es: [Pruebas Unitarias](testing/unit.md)

source: [Functional tests](testing/functional.md)
es: [Pruebas Funcionales](testing/functional.md)

source: [Acceptance tests](testing/acceptance.md)
es: [Pruebas de Aceptación](testing/acceptance.md)

source: [Fixtures](testing/fixtures.md)
es: [Datos de Prueba (Fixtures)](testing/fixtures.md)

source: Special topics -
es: Temas Especiales

source: [Building application from scratch](tutorial/start-from-scratch.md) -
es: [Creación de una Aplicación Desde Cero](tutorial/start-from-scratch.md)

source: [Console applications](tutorial/console-applications.md) +
es: [Comandos de Consola](tutorial/console-applications.md)

source: [Internationalization](tutorial/i18n.md) -
es: [Internacionalización](tutorial/i18n.md)

source: [Mailing](tutorial/mailing.md) +
es: [Envío de Correos Electrónicos](tutorial/mailing.md)

source: [Performance tuning](tutorial/performance-tuning.md) +
es: [Ajustes de Rendimiento](tutorial/performance-tuning.md)

source: [Using Yii with event loop](tutorial/using-with-event-loop.md) +
es: [Utilizar Yii con Bucle de Eventos](tutorial/using-with-event-loop.md)

source: [Using Yii with RoadRunner](tutorial/using-yii-with-roadrunner.md) +
es: [Utilizar Yii con RoadRunner](tutorial/using-yii-with-roadrunner.md)

source: Helpers +
es: Clases Auxiliares
