Repository: yiisoft/docs
Catalog: _translations/guide/po/*/security_cryptography.md.po
Languages: ru

source: Cryptography
ru: Криптография

source: In this section, we'll review the following security aspects:
ru: В этом разделе мы рассмотрим следующие аспекты безопасности:

source: Generating random data
ru: Генерация случайных данных

source: Encryption and Decryption
ru: Шифрование и расшифровка

source: Confirming Data Integrity
ru: Проверка целостности данных

source: To use these features, you need to install `yiisoft/security` package:
ru: Для использования этих функций, вам нужно установить пакет `yiisoft/security`:

source: Generating pseudorandom data
ru: Генерация псевдослучайных данных

source: Pseudorandom data are useful in many situations. For example, when resetting a password via email, you need to generate a token, save it to the database, and send it via email to the end user, which in turn will allow them to prove ownership of that account. It's important that this token be unique and hard to guess, else there is a possibility that an attacker can predict the token's value and reset the user's password.
ru: Псевдослучайные данные используются во многих ситуациях. Например, при изменении пароля по email, вам необходимо сгенерировать токен, сохранить его в базу данных и отправить по email пользователю, чтобы он с помощью него подтвердил владение аккаунтом. Важно, чтобы этот токен был уникальным и его было трудно угадать, иначе есть вероятность, что атакующий может предсказать значение токена и сбросить пароль пользователя.

source: `\Yiisoft\Security\Random` makes generating pseudorandom data simple:
ru: Класс `\Yiisoft\Security\Random` делает генерацию псевдослучайных данных простой:

source: The code above would give you a random string consisting of 42 characters.
ru: Код выше даст вам случайную строку, включающую 42 символа.

source: If you need bytes or integers, use PHP functions directly:
ru: Если вам нужны байты или целые числа, напрямую используйте функции PHP:

source: `random_bytes()` for bytes. Note that the output may not be ASCII.
ru: `random_bytes()` для генерации байт. Обратите внимание, что вывод может быть не ASCII.

source: `random_int()` for integers.
ru: `random_int()` для генерации целых чисел.

source: Encryption and decryption
ru: Шифрование и расшифровка

source: Yii provides convenient helper functions to encrypt/decrypt data using a secret key. The data is passed through the encryption function so that only the person who has the secret key will be able to decrypt it. For example, you need to store some information in your database, but you need to make sure only the user who has the secret key can view it (even if one compromises the application database):
ru: Yii предоставляет удобные вспомогательные функции для шифрования/расшифровки данных с помощью секретного ключа. Данные проходят через функцию шифрования таким образом, что только тот, кто знает секретный ключ, может расшифровать их. Например, вам нужно сохранить некоторую информацию в вашей базе данных, но вы должны быть уверены, что только пользователь, который знает секретный ключ, сможет расшифровать их (даже если кто-нибудь скомпрометирует базу данных приложения):

source: $encryptedData = (new \Yiisoft\Security\Crypt())->encryptByPassword($data, $password); // save data to a database or another storage saveData($encryptedData);
ru: $encryptedData = (new \Yiisoft\Security\Crypt())->encryptByPassword($data, $password); // сохранение данных в базу данных или другое хранилище saveData($encryptedData);

source: Decrypting it:
ru: Расшифровка:

source: // collect encrypted data from a database or another storage $encryptedData = getEncryptedData(); $data = (new \Yiisoft\Security\Crypt())->decryptByPassword($encryptedData, $password);
ru: // получение зашифрованных данных из базы данных или другого хранилища $encryptedData = getEncryptedData(); $data = (new \Yiisoft\Security\Crypt())->decryptByPassword($encryptedData, $password);

source: You could use a key instead of a password:
ru: Вы можете использовать ключ вместо пароля:

source: $encryptedData = (new \Yiisoft\Security\Crypt())->encryptByKey($data, $key); // save data to a database or another storage saveData($encryptedData);
ru: $encryptedData = (new \Yiisoft\Security\Crypt())->encryptByKey($data, $key); // сохранение данных в базу данных или другое хранилище saveData($encryptedData);

source: // collect encrypted data from a database or another storage $encryptedData = getEncryptedData(); $data = (new \Yiisoft\Security\Crypt())->decryptByKey($encryptedData, $key);
ru: // получение зашифрованных данных из базы данных или другого хранилища $encryptedData = getEncryptedData(); $data = (new \Yiisoft\Security\Crypt())->decryptByKey($encryptedData, $key);

source: Confirming data integrity
ru: Проверка целостности данных

source: There are situations in which you need to verify that your data hasn't been tampered with by a third party or even corrupted in some way. Yii provides a way to confirm data integrity by MAC signing.
ru: Бывают ситуации, когда вам необходимо убедиться, что ваши данные не были подделаны третьей стороной или испорчены каким-то образом. Yii предоставляет способ проверить целостность данных по MAC подписи.

source: The `$key` should be present at both sending and receiving sides. On the sending side:
ru: Ключ `$key` должен присутствовать как на отправляющей, так и на принимающей стороне. На отправляющей стороне:

source: On the receiving side:
ru: На принимающей стороне:

source: $signedMessage = receiveMessage($signedMessage); try { $message = (new \Yiisoft\Security\Mac())->getMessage($signedMessage, $key); } catch (\Yiisoft\Security\DataIsTamperedException $e) { // data is tampered }
ru: $signedMessage = receiveMessage($signedMessage); try { $message = (new \Yiisoft\Security\Mac())->getMessage($signedMessage, $key); } catch (\Yiisoft\Security\DataIsTamperedException $e) { // данные подделаны }

source: Masking token length
ru: Маскировка длины токена

source: Masking a token helps to mitigate a BREACH attack by randomizing how the token outputted on each request. A random mask is applied to the token, making the string always unique.
ru: Маскировка токена помогает смягчить атаку BREACH за счет рандомизации способа вывода токена при каждом запросе. К токену применяется случайная маска, делающая строку всегда уникальной.

source: To mask a token:
ru: Для маскировки токена:

source: To get the original value from the masked one:
ru: Получить исходное значение из замаскированного:
