Repository: yiisoft/docs
Catalog: _translations/po/*/guide_start_creating-project.md.po
Languages: it

source: Creating a project
it: Creazione di un progetto

source: In this guide we'll provide commands for both [Docker](https://docs.docker.com/get-started/get-docker/) and the built-in dev server with everything installed locally.
it: In questa guida forniremo comandi sia per [Docker](https://docs.docker.com/get-started/get-docker/) che per il server di sviluppo integrato con tutto installato localmente.

source: > [!NOTE] > If you want to use another web server, > see ["Configuring web servers"](../../cookbook/configuring-webservers/general.md).
it: > [!NOTE] > Se si desidera utilizzare un altro server web, > consultare ["Configurazione dei server Web"](../../cookbook/configuring-webservers/general.md).

source: We recommend starting with a project template that's a minimal working Yii project implementing some basic features. It can serve as a good starting point for your projects.
it: Si consiglia di iniziare con un template di progetto che sia un progetto Yii minimale funzionante che implementa alcune funzionalità di base. Può fungere da buon punto di partenza per i propri progetti.

source: You can create a new project from a template using the [Composer](https://getcomposer.org) package manager:
it: È possibile creare un nuovo progetto da un template utilizzando il gestore di pacchetti [Composer](https://getcomposer.org):

source: Docker users can run the following commands:
it: Gli utenti Docker possono eseguire i seguenti comandi:

source: If you want development version instead of release one:
it: Se vuoi la versione di sviluppo invece di quella di rilascio:

source: This installs the latest stable version of the Yii project template in a directory named `your_project`. You can choose a different directory name if you want.
it: Questo installa l'ultima versione stabile del template di progetto Yii in una directory denominata `your_project`. È possibile scegliere un nome di directory diverso se lo si desidera.

source: > [!TIP] > If you want to install the latest development version of Yii, you may add `--stability=dev` to the command. > Don't use the development version of Yii for production because it may break your running code.
it: > [!TIP] > Se si desidera installare l'ultima versione di sviluppo di Yii, è possibile aggiungere `--stability=dev` al comando. > Non utilizzare la versione di sviluppo di Yii in produzione perché potrebbe compromettere il codice in esecuzione.

source: Go into the newly created directory and run:
it: Accedere alla directory appena creata ed eseguire:

source: For Docker users, run:
it: Per gli utenti Docker, eseguire:

source: Open your browser to the URL `http://localhost/`.
it: Aprire il browser all'URL `http://localhost/`.

source: > [!NOTE] > The HTTP server listens on port 80. If that port is already in use, specify the port via `--port` or, in case of Docker, > `DEV_PORT` in the `docker/.env` file.
it: > [!NOTE] > Il server HTTP è in ascolto sulla porta 80. Se quella porta è già in uso, specificare la porta tramite `--port` o, nel caso di Docker, > `DEV_PORT` nel file `docker/.env`.

source: ![Successful Installation of Yii](/images/guide/start/app-installed.png)
it: ![Installazione riuscita di Yii](/images/guide/start/app-installed.png)
