Repository: yiisoft/docs
Catalog: _translations/po/*/guide_concept_aliases.md.po
Languages: id, ru

source: Aliases
ru: Псевдонимы (алиасы)

source: You can use aliases to represent file paths or URLs so that you don't have to hard-code absolute paths or URLs in your project. An alias must start with the `@` character to be differentiated from normal file paths and URLs. Alias defined without leading `@` will be prefixed with `@` character.
id: Anda dapat menggunakan alias untuk merepresentasikan path file atau URL sehingga Anda tidak perlu menulis path absolut atau URL secara hard-code di proyek Anda. Sebuah alias harus diawali karakter `@` agar dapat dibedakan dari path file dan URL biasa. Alias yang didefinisikan tanpa `@` di awal akan diprefiks otomatis dengan karakter `@`.
ru: Вы можете использовать псевдонимы для представления путей к файлам или URL-адресов, чтобы вам не приходилось жестко указывать абсолютные пути или URL-адреса в вашем проекте. Каждый псевдоним должен начинаться с символа `@`, чтобы отличаться от обычных файловых путей или URL. Алиас, определенный без предшествующего `@` будет префиксироваться с помощью символа `@`.

source: Default Yii application has some aliases pre-defined in `config/params.php`. For example, the alias `@public` represents the web root path; `@baseUrl` represents the base URL for the currently running Web application.
id: Aplikasi Yii bawaan memiliki beberapa alias yang sudah didefinisikan di `config/params.php`. Misalnya, alias `@public` merepresentasikan path web root; `@baseUrl` merepresentasikan URL dasar untuk aplikasi Web yang sedang berjalan.
ru: По умолчанию Yii-приложение имеет несколько алисов, предопределенных в `config/params.php`. Например, алиас `@public` представляет корневой путь для web; `@baseUrl` представляет базовый URL для запущенного в текущий момент Web-приложения.

source: Defining aliases <span id="defining-aliases"></span>
ru: Определение псевдонимов <span id="defining-aliases"></span>

source: You can define an alias via application's `config/params.php`:
id: Anda dapat mendefinisikan sebuah alias melalui `config/params.php` aplikasi:
ru: Вы можете определить какой-либо псевдоним через `config/params.php` приложения:

source: return [ // ... 'yiisoft/aliases' => [ 'aliases' => [ // ... // an alias of a file path '@foo' => '/path/to/foo', // an alias of a URL '@bar' => 'https://www.example.com', // an alias of a concrete file that contains a \foo\Bar class '@foo/Bar.php' => '/definitely/not/foo/Bar.php', ], ], ];
ru: return [ // ... 'yiisoft/aliases' => [ 'aliases' => [ // ... // an alias of a file path '@foo' => '/path/to/foo', // an alias of a URL '@bar' => 'http://www.example.com', // an alias of a concrete file that contains a \foo\Bar class '@foo/Bar.php' => '/definitely/not/foo/Bar.php', ], ], ];

source: > [!NOTE] > The file path or URL being aliased may *not* necessarily refer to an existing file or resource.
id: > [!NOTE] > Path file atau URL yang dialias tidak harus selalu merujuk pada file atau sumber daya yang benar-benar ada.
ru: > Примечание: Псевдонимизированный файловый путь или URL *не обязательно* может ссылаться на существующий файл или > ресурс.

source: Given a defined alias, you may derive a new alias by appending a slash `/` followed with one or more path segments. For example, `@foo` is a root alias, while `@foo/bar/file.php` is a derived alias.
id: Dengan alias yang telah didefinisikan, Anda dapat menurunkan alias baru dengan menambahkan garis miring `/` diikuti satu atau beberapa segmen path. Sebagai contoh, `@foo` adalah alias akar (root), sedangkan `@foo/bar/file.php` adalah alias turunan.
ru: Учитывая определенный псевдоним, вы можете создать новый, добавив слэш `/`, за которым следует один или несколько сегментов пути. Например, `@foo` - это корневой псевдоним, а `@foo/bar/file.php` - производный псевдоним.

source: You can define an alias using another alias (either root or derived):
id: Anda dapat mendefinisikan sebuah alias menggunakan alias lain (baik alias akar maupun turunan):
ru: Вы можете определить псевдоним, используя другой псевдоним (корневой или производный):

source: The `yiisoft/aliases` parameter initializes `Aliases` service from [`yiisoft/aliases`](https://github.com/yiisoft/aliases) package. You can set extra aliases in runtime by using the service:
ru: Параметр `yiisoft/aliases` инициализирует сервис `Aliases` из пакета [`yiisoft/aliases`](https://github.com/yiisoft/aliases). Используя этот сервис, вы можете установить дополнительные псевдонимы во время работы приложения:

source: Using aliases in configuration <span id="using-aliases-in-configuration"></span>
id: Menggunakan aliases di konfigurasi <span id="using-aliases-in-configuration"></span>
ru: Использование псевдонимов в конфигурации <span id="using-aliases-in-configuration"></span>

source: It's preferred to resolve aliases at the configuration level, so services get URLs and paths as ready to use strings:
id: Disarankan untuk me-resolve alias pada level konfigurasi, sehingga service menerima URL dan path sebagai string siap pakai:
ru: Предпочтительно разрешать псевдонимы на уровне конфигурации, чтобы сервисы получали URL-адреса и пути как готовые к использованию строки:

source: Resolving aliases <span id="resolving-aliases"></span>
id: Me-resolve alias <span id="resolving-aliases"></span>
ru: Разрешение псевдонимов <span id="resolving-aliases"></span>

source: You can use `Aliases` service to resolve an alias or derived alias into the file path or URL it represents:
id: Anda dapat menggunakan layanan `Aliases`:
ru: Вы можете использовать сервис `Aliases`, чтобы преобразовать псевдоним или производный псевдоним в путь к файлу или URL, который он представляет:

source: use \Yiisoft\Aliases\Aliases; public function actionIndex(Aliases $aliases) { $foo = $aliases->get('@foo'); // /path/to/foo $bar = $aliases->get('@bar'); // https://www.example.com $file = $aliases->get('@foo/bar/file.php'); // /path/to/foo/bar/file.php }
ru: use \Yiisoft\Aliases\Aliases; public function actionIndex(Aliases $aliases) { $foo = $aliases->get('@foo'); // /path/to/foo $bar = $aliases->get('@bar'); // http://www.example.com $file = $aliases->get('@foo/bar/file.php'); // /path/to/foo/bar/file.php }

source: The path/URL represented by a derived alias is determined by replacing the root alias part with its corresponding path/URL in the derived alias.
id: Path/URL yang direpresentasikan oleh alias turunan ditentukan dengan mengganti bagian alias akar dengan path/URL yang sesuai pada alias turunan tersebut.
ru: Путь/URL, представленный производным псевдонимом, определяется путем замены части корневого псевдонима на соответствующий путь/URL в производном псевдониме.

source: > [!NOTE] > The `get()` method doesn't check whether the resulting path/URL refers to an existing file or resource.
id: > [!NOTE] > Metode `get()` tidak memeriksa apakah path/URL hasilnya merujuk pada file atau sumber daya yang ada.
ru: > Примечание: Метод `get()` не проверяет, относится ли результирующий путь/URL-адрес к существующему файлу или ресурсу.

source: A root alias may also contain slash `/` characters. The `get()` method is intelligent enough to tell, which part of an alias is a root alias and thus correctly determines the corresponding file path or URL:
id: Alias akar juga dapat berisi karakter garis miring `/`. Metode `get()` cukup cerdas untuk menentukan bagian mana dari sebuah alias yang merupakan alias akar, sehingga dapat menentukan path file atau URL yang sesuai dengan benar:
ru: Псевдоним root также может содержать символы косой черты `/`. Метод `get()` достаточно интеллектуален, чтобы определить, какая часть псевдонима является корневым псевдонимом, и, таким образом, правильно определить путь к соответствующему файлу или URL-адрес:

source: If `@foo/bar` isn't defined as a root alias, the last statement would display `/path/to/foo/bar/file.php`.
id: Jika `@foo/bar` tidak didefinisikan sebagai alias akar, pernyataan terakhir akan menghasilkan `/path/to/foo/bar/file.php`.
ru: Если бы `@foo/bar` не был бы определен как корневой псевдоним, то последний оператор отобразил бы `/path/to/foo/bar/file.php`.

source: Predefined aliases <span id="predefined-aliases"></span>
id: Alias bawaan <span id="predefined-aliases"></span>
ru: Предопределенные псевдонимы <span id="predefined-aliases"></span>

source: [Yii application](https://github.com/yiisoft/app) predefines a set of aliases to reference commonly used file paths and URLs:
id: [Aplikasi Yii](https://github.com/yiisoft/app) mendefinisikan serangkaian alias untuk mereferensikan path file dan URL yang umum digunakan:
ru: [Yii приложение](https://github.com/yiisoft/app) предопределяет набор псевдонимов, чтобы ссылаться на часто используемые файловые пути и URL-адреса:

source: `@root` - the base directory of the currently running application.
id: `@root` - direktori dasar dari aplikasi yang sedang berjalan.
ru: `@root` - базовая директория для приложения запущенного в текущий момент.

source: `@assets` - application's public directory where it publishes assets.
id: `@assets` - direktori publik aplikasi tempat aset dipublikasikan.
ru: `@assets` - публичная директория приложения, где оно публикует ресурсы (assets).

source: `@assetsUrl` - URL of base directory with published assets.
id: `@assetsUrl` - URL direktori dasar tempat aset dipublikasikan.
ru: `@assetsUrl` - URL базовой директории с опубликованными ресурсами.

source: `@baseUrl` - the base URL of the currently running Web application. Defaults to `/`.
id: `@baseUrl` - URL dasar aplikasi Web yang sedang berjalan. Bawaannya `/`.
ru: `@baseUrl` - базовый URL запущенного в текущий момент Web приложения. По умолчанию - `/`.

source: `@npm` - node packages directory.
id: `@npm` - direktori paket Node.
ru: `@npm` - директория пакетов Node JS.

source: `@bower` - bower packages directory.
id: `@bower` - direktori paket bower.
ru: `@bower` - директория пакетов Bower.

source: `@vendor` - Composer's `vendor` directory.
id: `@vendor` - direktori `vendor` milik Composer.
ru: `@vendor` - директория `vendor` Composer'а .

source: `@public` - application's publicly accessible directory that with `index.php`.
id: `@public` - direktori publik aplikasi yang berisi `index.php`.
ru: `@public` - публично доступная директория приложения, которая содержит `index.php`.

source: `@runtime` - the runtime path of the currently running application. Defaults to `@root/runtime`.
id: `@runtime` - path runtime aplikasi yang sedang berjalan. Bawaannya `@root/runtime`.
ru: `@runtime` - путь времени выполнения текущего запущенного приложения. По умолчанию - `@root/runtime`.

source: `@layout` - the directory with layouts.
id: `@layout` - direktori berkas layout.
ru: `@layout` - директория с макетами.

source: `@resources` - directory with views, asset sources and other resources.
id: `@resources` - direktori yang berisi view, sumber aset, dan sumber daya lainnya.
ru: `@resources` - директория с представлениями, исходниками ресурсов (asset) и другими ресурсами.

source: `@views` - application view templates base directory.
id: `@views` - direktori dasar template view aplikasi.
ru: `@views` - базовая директория шаблонов представлений приложения.
