Repository: yiisoft/docs
Catalog: _translations/po/*/guide_start_prerequisites.md.po
Languages: it, ru

source: What do you need to know?
it: Cosa devi sapere?
ru: Что нужно знать?

source: The Yii learning curve isn't as steep as other PHP frameworks, but still, there are some things you should learn before starting with Yii.
it: La curva di apprendimento di Yii non è così ripida come quella di altri framework PHP, ma ci sono comunque alcune cose che dovresti imparare prima di iniziare a usare Yii.
ru: Освоить Yii обычно проще, чем многие другие PHP‑фреймворки, но перед началом работы всё же стоит изучить несколько базовых тем.

source: Yii is a PHP framework, so make sure you [read and understand language reference](https://www.php.net/manual/en/langref.php).
it: Yii è un framework PHP, quindi assicurarsi di [leggere e comprendere il riferimento del linguaggio](https://www.php.net/manual/en/langref.php).
ru: Yii — PHP‑фреймворк, поэтому стоит ознакомиться со [справочником по языку PHP](https://www.php.net/manual/ru/langref.php) и понимать изложенный там материал.

source: Object-oriented programming
it: Programmazione orientata agli oggetti
ru: Объектно‑ориентированное программирование

source: You need a basic understanding of object-oriented programming. If you're not familiar with it, check one of the many tutorials available such as [the one from tuts+](https://code.tutsplus.com/tutorials/object-oriented-php-for-beginners--net-12762).
it: È necessaria una conoscenza di base della programmazione orientata agli oggetti. Se non si ha familiarità con questo argomento, consultare uno dei numerosi tutorial disponibili, [come quello offerto da tuts+](https://code.tutsplus.com/tutorials/object-oriented-php-for-beginners--net-12762).
ru: Вам понадобится базовое понимание объектно‑ориентированного программирования (ООП). Если вы с ним не знакомы, изучите один из доступных материалов, например [руководство от tuts+](https://code.tutsplus.com/tutorials/object-oriented-php-for-beginners--net-12762).

source: When you develop with Yii, you write code in an object-oriented fashion, so make sure you're familiar with [PHP OOP support](https://www.php.net/manual/en/language.oop5.php).
it: Quando si sviluppa con Yii, si scrive codice in modo orientato agli oggetti, quindi assicurarsi di avere familiarità con il [supporto OOP di PHP](https://www.php.net/manual/en/language.oop5.php).
ru: Разрабатывая на Yii, вы пишете код в объектно‑ориентированном стиле, поэтому важно разбираться в [поддержке ООП в PHP](https://www.php.net/manual/ru/language.oop5.php).

source: Note that the more complicated your application is, the more advanced OOP concepts you should learn to successfully manage that complexity.
it: Si noti che più l'applicazione è complessa, più concetti OOP avanzati si dovrebbero apprendere per gestire con successo tale complessità.
ru: Обратите внимание: чем сложнее приложение, тем более продвинутые концепции ООП необходимо изучить, чтобы успешно управлять этой сложностью.

source: Command line and Composer
it: Riga di comando e Composer
ru: Командная строка и Composer

source: Yii extensively uses the de-facto standard PHP package manager, [Composer](https://getcomposer.org) so make sure you read and understand its [guide](https://getcomposer.org/doc/01-basic-usage.md). If you aren't familiar with using the command line, it's time to start trying. Once you learn the basics, you'll never want to work without it.
it: Yii utilizza ampiamente il gestore di pacchetti PHP standard de facto, [Composer](https://getcomposer.org), quindi assicurarsi di leggere e comprendere la sua [guida](https://getcomposer.org/doc/01-basic-usage.md). Se non si ha familiarità con l'uso della riga di comando, è il momento di iniziare a provarla. Una volta appresi i concetti di base, non si vorrà più farne a meno.
ru: Yii активно использует де‑факто стандартный менеджер пакетов PHP — [Composer](https://getcomposer.org), поэтому стоит ознакомиться с его [руководством](https://getcomposer.org/doc/01-basic-usage.md) и понимать основы. Если вы не привыкли работать в командной строке, самое время начать. Освоив базовые команды, вы вряд ли захотите обходиться без неё.

source: Since Yii is a web framework and the web largely uses HTTP, it's a good idea to [learn more about it](https://developer.mozilla.org/en-US/docs/Web/HTTP).
it: Poiché Yii è un framework web e il web utilizza principalmente HTTP, è consigliabile [saperne di più](https://developer.mozilla.org/en-US/docs/Web/HTTP).
ru: Поскольку Yii — веб‑фреймворк, а веб во многом работает поверх HTTP, рекомендуется [изучить этот протокол подробнее](https://developer.mozilla.org/ru/docs/Web/HTTP).

source: The default application template leverages Docker, so we recommend that you [read and understand the concepts](https://docs.docker.com/get-started/).
it: Il modello di applicazione predefinito sfrutta Docker, pertanto ti consigliamo di [leggere e comprendere i concetti](https://docs.docker.com/get-started/).
ru: Шаблон приложения по умолчанию использует Docker, поэтому мы рекомендуем [ознакомиться с его основными концепциями](https://docs.docker.com/get-started/).

source: Also, you will benefit from familiarizing yourself with [twelve-factor app](https://12factor.net/) principles.
it: Inoltre, sarà utile familiarizzare con i principi della [twelve-factor app](https://12factor.net/).
ru: Также будет полезно ознакомиться с принципами методологии [Twelve‑Factor App](https://12factor.net/ru/).
