Repository: yiisoft/docs
Catalog: _translations/po/*/guide_start_databases.md.po
Languages: ru

source: Working with databases
ru: Работа с базами данных

source: Yii doesn't dictate using a particular database or storage for your application. There are many ways you can work with relational databases:
ru: Yii не требует использования конкретной базы данных или хранилища для вашего приложения. Существует множество способов работы с реляционными базами данных:

source: [Cycle](https://github.com/cycle) via [Yii Cycle package](https://github.com/yiisoft/yii-cycle)
ru: [Cycle](https://github.com/cycle) через [пакет Yii Cycle](https://github.com/yiisoft/yii-cycle)

source: [Doctrine](https://www.doctrine-project.org/) via [Yii Doctrine package](https://github.com/stargazer-team/yii-doctrine)
ru: [Doctrine](https://www.doctrine-project.org/) через [пакет Yii Doctrine](https://github.com/stargazer-team/yii-doctrine)

source: [PDO](https://www.php.net/manual/en/book.pdo.php)
ru: [PDO](https://www.php.net/manual/ru/book.pdo.php)

source: For non-relational ones, there are usually official libraries available:
ru: Для нереляционных баз данных обычно доступны официальные библиотеки:

source: In this guide, we will focus on working with relational databases using Yii DB. We'll use PostgreSQL to implement a simple CRUD (create read update delete).
ru: В этом руководстве мы сосредоточимся на работе с реляционными базами данных с помощью Yii DB. Мы будем использовать PostgreSQL для реализации простого CRUD (создание, чтение, обновление, удаление).

source: Installing PostgreSQL
ru: Установка PostgreSQL

source: You need to install PostgreSQL. If you prefer not to use Docker, [get the installer from official website](https://www.postgresql.org/download/), install it and create a database.
ru: Необходимо установить PostgreSQL. Если вы предпочитаете не использовать Docker, [загрузите установщик с официального сайта](https://www.postgresql.org/download/), установите его и создайте базу данных.

source: If you use Docker, it is a bit simpler. Modify `docker/dev/compose.yml`:
ru: При использовании Docker всё немного проще. Измените файл `docker/dev/compose.yml`:

source: Note that we add `depends_on` so application waits for database to be up.
ru: Обратите внимание, что мы добавляем `depends_on`, чтобы приложение ждало запуска базы данных.

source: Also, we'll need a `pdo_pgsql` extension to communicate with PostgreSQL. You can enable it locally in `php.ini`. If you use Docker, check `docker/Dockerfile` and add `pdo_pgsql` in `install-php-extensions` list. Then rebuild PHP image with `make build && make down && make up`.
ru: Также потребуется расширение `pdo_pgsql` для взаимодействия с PostgreSQL. Его можно включить локально в файле `php.ini`. При использовании Docker проверьте файл `docker/Dockerfile` и добавьте `pdo_pgsql` в список `install-php-extensions`. Затем пересоберите образ PHP командой `make build && make down && make up`.

source: Configuring connection
ru: Настройка подключения

source: Now that we have the database, it's time to define the connection.
ru: Теперь, когда у нас есть база данных, пришло время определить подключение.

source: First we need a package to be installed:
ru: Сначала нам нужно установить пакет:

source: Now create `config/common/di/db-pgsql.php`:
ru: Теперь создайте файл `config/common/di/db-pgsql.php`:

source: And define parameters in `config/common/params.php`. For Docker that would be:
ru: Определите параметры в файле `config/common/params.php`. Для Docker это будет:

source: `db` host is resolved automatically within the Docker network.
ru: Хост `db` автоматически разрешается внутри сети Docker.

source: For local installation without Docker the host in Dsn would be `localhost`. You'll have to adjust the rest to match how you configured the database.
ru: Для локальной установки без Docker хост в Dsn будет `localhost`. Остальные параметры необходимо настроить в соответствии с конфигурацией вашей базы данных.

source: Creating and applying migrations
ru: Создание и применение миграций

source: For the initial state of the application and for further database changes, it is a good idea to use migrations. These are files that create database changes. Applied migrations are tracked in the database, allowing us to know the current state and which migrations remain to be applied.
ru: Для начальной настройки приложения и для дальнейших изменений базы данных рекомендуется использовать миграции. Это файлы, которые описывают изменения в структуре базы данных. Примененные миграции отслеживаются в базе данных, что позволяет отслеживать текущее состояние и определять, какие миграции еще необходимо применить.

source: To use migrations we need another package installed:
ru: Для использования миграций нам нужно установить еще один пакет:

source: Create a directory to store migrations `src/Migration` right in the project root. Add the following configuration to `config/common/params.php`:
ru: Создайте каталог для хранения миграций `src/Migration` в корневой директории проекта. Добавьте следующую конфигурацию в файл `config/common/params.php`:

source: Now you can use `make yii migrate:create page` to create a new migration. For our example we need a `page` table with some columns:
ru: Теперь можно использовать команду `make yii migrate:create page` для создания новой миграции. Для нашего примера необходима таблица `page` с несколькими столбцами:

source: The `M251102141707Page` name of the migration class is generated so replace the `Page` suffix with the actual migration name. The `M251102141707` prefix is needed to find and sort migrations in the order they were added.
ru: Имя класса миграции `M251102141707Page` генерируется автоматически, поэтому замените суффикс `Page` на фактическое имя миграции. Префикс `M251102141707` необходим для поиска и сортировки миграций в порядке их добавления.

source: Note that we use UUID as the primary key. We are going to generate these IDs ourselves instead of relying on database so we'll need an extra compose package for that.
ru: Обратите внимание, что мы используем UUID в качестве первичного ключа. Мы собираемся генерировать эти идентификаторы самостоятельно, вместо того чтобы полагаться на базу данных, для этого нам понадобится добавить дополнительный пакет composer.

source: While the storage space is a bit bigger than using int, the workflow with such IDs is beneficial. Since you generate the ID yourself so you can define a set of related data and save it in a single transaction. The entities that define this set of data in the code are often called an "aggregate".
ru: Хотя объем хранилища немного больше, чем при использовании int, работа с такими идентификаторами имеет свои преимущества. Поскольку идентификатор генерируется самостоятельно, можно определить набор связанных данных и сохранить его в одной транзакции. Сущности, которые определяют этот набор данных в коде, часто называются "агрегатом".

source: Apply the migration with `make yii migrate:up`.
ru: Примените миграцию с помощью `make yii migrate:up`.

source: An entity
ru: Сущность

source: Now that you have a table it is time to define an entity in the code. Create `src/Web/Page/Page.php`:
ru: Теперь, когда таблица создана, необходимо определить сущность в коде. Создайте файл `src/Web/Page/Page.php`:

source: Repository
ru: Репозиторий

source: Now that we have entity, we need a place for methods to save an entity, delete it and select either a single page or multiple pages.
ru: Теперь, когда сущность создана, необходимо место для методов сохранения, удаления и выборки одной или нескольких страниц.

source: Create `src/Web/Page/PageRepository.php`:
ru: Создайте файл `src/Web/Page/PageRepository.php`:

source: In this repository there are both methods to get data and `save()` to do insert or update. DB returns raw data as arrays but our repository automatically creates entities from this raw data so later we operate typed data.
ru: В этом репозитории есть методы для получения данных и метод `save()` для вставки или обновления записей. База данных возвращает необработанные данные в виде массивов, но репозиторий автоматически создает из них сущности, что позволяет в дальнейшем работать с типизированными данными.

source: Actions and routes
ru: Действия и маршруты

source: We need some actions to:
ru: Необходимо создать действия для:

source: List all pages.
ru: Вывести список всех страниц.

source: View a page.
ru: Просмотреть страницу.

source: Delete a page.
ru: Удалить страницу.

source: Create a page.
ru: Создать страницу.

source: Update a page.
ru: Обновить страницу.

source: Then we need routing for all these.
ru: Затем необходимо настроить маршрутизацию для всех этих действий.

source: Let's tackle these one by one.
ru: Рассмотрим их по очереди.

source: Create `src/Web/Page/ListAction.php`:
ru: Создайте файл `src/Web/Page/ListAction.php`:

source: Define list view in `src/Web/Page/list.php`:
ru: Создайте представление списка в файле `src/Web/Page/list.php`:

source: View a page
ru: Просмотр страницы

source: Create `src/Web/Page/ViewAction.php`:
ru: Создайте файл `src/Web/Page/ViewAction.php`:

source: Now, a template in `src/Web/Page/view.php`:
ru: Теперь создайте шаблон в файле `src/Web/Page/view.php`:

source: In this view we have a form that submits a request for page deletion. Handing it with `GET` is common as well, but it is very wrong. Since deletion changes data, it needs to be handled by one of the non-idempotent HTTP methods. We use POST and a form in our example, but it could be `DELETE` and async request made with JavaScript. The button could be later styled properly to look similar to the "Edit".
ru: В этом представлении есть форма, которая отправляет запрос на удаление страницы. Обработка таких запросов через `GET` тоже встречается, но это неправильно. Поскольку удаление изменяет данные, оно должно обрабатываться одним из неидемпотентных HTTP-методов. В нашем примере используется POST и форма, но это может быть и `DELETE` с асинхронным запросом на JavaScript. Кнопку можно позже стилизовать, чтобы она выглядела похоже на "Редактировать".

source: Delete a page
ru: Удаление страницы

source: Create `src/Web/Page/DeleteAction.php`:
ru: Создайте файл `src/Web/Page/DeleteAction.php`:

source: Create or update a page
ru: Создание или обновление страницы

source: First of all, we need a form at `src/Web/Page/Form.php`:
ru: Прежде всего, необходимо создать форму в файле `src/Web/Page/Form.php`:

source: Then an action. Create `src/Web/Page/EditAction.php`:
ru: Затем создайте действие в файле `src/Web/Page/EditAction.php`:

source: Note that `Uuid::uuid7()->toString()` won't work for MySQL and you'll need bytes instead, `Uuid::uuid7()->getBytes()`.
ru: Обратите внимание, что `Uuid::uuid7()->toString()` не будет работать для MySQL, и вам понадобятся байты вместо этого, `Uuid::uuid7()->getBytes()`.

source: In the above we use a special slug in the URL for new pages so the URL looks like `http://localhost/pages/new`. If the page isn't new, we pre-fill the form with the data from the database. Similar to how we did in [Working with forms](forms.md), we handle the form submission. After successful save we redirect to the page view.
ru: В приведенном выше коде используется специальный slug в URL для новых страниц, чтобы URL выглядел как `http://localhost/pages/new`. Если страница не новая, форма предварительно заполняется данными из базы данных. Аналогично тому, как это было сделано в разделе [Работа с формами](forms.md), обрабатывается отправка формы. После успешного сохранения происходит перенаправление на страницу просмотра.

source: Now, a template in `src/Web/Page/edit.php`:
ru: Теперь создайте шаблон в файле `src/Web/Page/edit.php`:

source: Routing
ru: Маршрутизация

source: Adjust `config/common/routes.php`:
ru: Измените файл `config/common/routes.php`:

source: Note that we've grouped all page-related routes with a group under `/pages` prefix. That is a convenient way to both not to repeat yourself and add some extra middleware, such as authentication, to the whole group.
ru: Обратите внимание, что все маршруты, связанные со страницами, сгруппированы под префиксом `/pages`. Это удобный способ избежать дублирования кода и применить дополнительные обработчики запросов, такие как аутентификация, ко всем маршрутам в группе.

source: Trying it out
ru: Проверка работы

source: Now try it out by opening `http://localhost/pages` in your browser.
ru: Теперь проверьте результат, открыв в браузере `http://localhost/pages`.
