Repository: yiisoft/docs
Catalog: _translations/po/*/guide_start_forms.md.po
Languages: ru

source: Working with forms
ru: Работа с формами

source: This section continues to improve on "Saying Hello." Instead of using URL, you will now ask a user for a message via form.
ru: Этот раздел улучшает пример "Говорим «Привет»". Вместо использования URL, теперь вы запросите сообщение от пользователя через форму.

source: Through this tutorial, you will learn how to:
ru: В этом руководстве вы узнаете, как:

source: Create a form model to represent the data entered by a user through a form.
ru: Создать модель формы для представления данных, введенных пользователем через форму.

source: Declare rules to validate the data entered.
ru: Объявить правила для проверки введённых данных.

source: Build an HTML form in a view.
ru: Построить HTML-форму в представлении.

source: Installing form package
ru: Установка пакет форм

source: To install form package, issue the following command in your application directory:
ru: Чтобы установить пакет для работы с формами, выполните следующую команду в директории вашего приложения:

source: For Docker that would be:
ru: Для Docker это будет:

source: Creating a form <span id="creating-form"></span>
ru: Создание формы <span id="creating-form"></span>

source: The data to be requested from the user will be represented by a `Form` class as shown below and saved in the file `/src/Web/Echo/Form.php`:
ru: Данные, которые будут запрошены у пользователя, будут представлены классом `Form`, как показано ниже, и сохранены в файле `/src/Web/Echo/Form.php`:

source: In the above example, the `Form` has a single string property `$message` which length should be at least of two characters. There's also a custom label for the property.
ru: В приведенном выше примере класс `Form` имеет одно строковое свойство `$message`, длина которого должна быть не менее двух символов. Также для свойства задана пользовательская метка.

source: Using the form <span id="using-form"></span>
ru: Использование формы <span id="using-form"></span>

source: Now that you have a form, use it in your action from "[Saying Hello](hello.md)".
ru: Теперь, когда у вас есть форма, используйте её в вашем обработчике из раздела "[Говорим «Привет»](hello.md)".

source: Here's what you end up with in `/src/Web/Echo/Action.php`:
ru: Вот что у вас получится в файле `/src/Web/Echo/Action.php`:

source: Instead of reading from route, you fill your form from request's POST data and validate it with the help of `FormHydrator`. Next you pass the form to the view.
ru: Вместо чтения из роута вы заполняете форму из данных POST запроса и проверяете её с помощью `FormHydrator`. Затем вы передаёте форму в представление.

source: For the form to function we need to allow both GET to render the form and POST to send the data. Adjust your route in `config/common/routes.php`:
ru: Чтобы форма работала, нужно разрешить GET-запросы для отображения формы и POST-запросы для отправки данных. Настройте ваш роут в `config/common/routes.php`:

source: Adjusting view
ru: Настройка представления

source: To render a form, you need to change your view, `src/Web/Echo/template.php`:
ru: Для отображения формы необходимо изменить ваше представление `src/Web/Echo/template.php`:

source: If the form is valid, you display a message. The rest initializes and renders the form.
ru: Если форма валидна, вы отобразите сообщение. Остальной код инициализирует и отображает форму.

source: First, you initialize `$htmlForm` with the POST type and the action URL generated with the help from the URL generator. You can access it as `$urlGenerator` in all views. You also need to pass the CSRF token to the form, which is also available in every view as `$csrf` thanks to the view injections listed in `config/common/params.php`:
ru: Инициализируйте `$htmlForm` с типом POST и URL обработчика, используя URL генератор. Вы можете получить к нему доступ как `$urlGenerator` во всех представлениях. Передайте в форму CSRF-токен `$csrf`, который доступен в представлениях благодаря инъекция из `config/common/params.php`:

source: The template renders the CSRF token value as a hidden input to ensure that the request originates from the form page and not from another website. It will be submitted along with POST form data. Omitting it would result in [HTTP response code 422](https://tools.ietf.org/html/rfc4918#section-11.2).
ru: Шаблон отображает значение CSRF-токена как скрытое поле, чтобы убедиться, что запрос исходит со страницы формы, а не с другого веб-сайта. Он будет отправлен вместе с POST-данными формы. Его отсутствие приведёт к [HTTP-коду ответа 422](https://tools.ietf.org/html/rfc4918#section-11.2).

source: You use `Field::text()` to output "message" field, so it takes care about filling the value, escaping it, rendering field label and validation errors.
ru: `Field::text()` выводит поле \"message\" и автоматически заполняет значение, экранирует его, отображает метку и ошибки валидации.

source: Now, in case you submit an empty message, you will get a validation error: "The message to be echoed must contain at least 2 characters."
ru: Теперь, если вы отправите пустое сообщение, вы получите ошибку валидации: "The message to be echoed must contain at least 2 characters."

source: Trying it Out <span id="trying-it-out"></span>
ru: Проверка работы <span id="trying-it-out"></span>

source: To see how it works, use your browser to access the following URL:
ru: Чтобы увидеть, как это работает, откройте в браузере следующий URL:

source: You will see a page with a form input field and a label that indicates what data to enter. Also, the form has a "submit" button labeled "Say". If you click the "submit" button without entering anything, you will see that the field is required. If you enter a single character, the form displays an error message next to the problematic input field.
ru: Вы увидите страницу с полем ввода и меткой, указывающей, какие данные нужно ввести. Также есть кнопка отправки с надписью \"Say\". Если нажать её без ввода данных, появится сообщение о том, что поле обязательно для заполнения. Если ввести один символ, отобразится ошибка валидации.

source: ![Form with a validation error](/images/guide/start/form-error.png)
ru: ![Форма с ошибкой валидации](/images/guide/start/form-error.png)

source: After you enter a valid message and click the "submit" button, the page echoes the data that you entered.
ru: После того как вы введёте корректное сообщение и нажмёте кнопку отправки, страница отобразит введённые вами данные.

source: ![Form with a success message](/images/guide/start/form-success.png)
ru: ![Успешная отправка формы](/images/guide/start/form-success.png)

source: Summary <span id="summary"></span>
ru: Краткое содержание <span id="summary"></span>

source: In this section of the guide, you've learned how to create a form model class to represent the user data and validate said data.
ru: В этом разделе руководства вы узнали, как создать класс модели формы для представления данных пользователя и валидации этих данных.

source: You've also learned how to get data from users and how to display data back in the browser. This is a task that could take you a lot of time when developing an application, but Yii provides powerful widgets to make this task easy.
ru: Вы также узнали, как получать информацию от пользователей и показывать её в браузере. Обычно на это уходит много времени при разработке приложения, но виджеты Yii значительно упрощают работу.

source: In the next section, you will learn how to work with databases, which are needed in nearly every application.
ru: В следующем разделе вы узнаете, как работать с базами данных, которые необходимы почти в каждом приложении.
