Repository: yiisoft/docs
Catalog: _translations/po/*/guide_concept_events.md.po
Languages: es

source: Events
es: Eventos

source: Events allow you to make custom code executed at certain execution points without modifying existing code. You can attach a custom code called "handler" to an event so that when the event is triggered, the handler gets executed automatically.
es: Los eventos permiten ejecutar código personalizado en ciertos puntos de ejecución sin modificar el código existente. A un evento se le puede acoplar un código especial llamado gestor (handler), de manera que una vez que el evento se dispare (triggered), el código se ejecuta de manera automática.

source: For example, when a user is signed up, you need to send a welcome email. You can do it right in the `SignupService` but then, when you additionally need to resize user's avatar image, you'll have to change `SignupService` code again. In other words, `SignupService` will be coupled to both code sending welcome email and code resizing avatar image.
es: Por ejemplo, cuando un usuario se registra debes enviarle un correo electrónico de bienvenida. Puedes realizar esto directamente en `RegistroService`, pero luego adicionalmente debes redimensionar la imagen del avatar del usuario, y tendrás que modificar nuevamente `RegistroService`. En otras palabras, a `RegistroService` se le acoplan el codigo de enviar un correo de bienvenida y redimensionar la imagen del avatar.

source: To avoid it, instead of telling what do after signup explicitly you can, instead, raise `UserSignedUp` event and then finish a signup process. The code sending an email and the code resizing avatar image will attach to the event and, therefore, will be executed. If you'll ever need to do more on signup, you'll be able to attach extra event handlers without modifying `SignupService`.
es: Para evitar todo eso, en vez de decir explicitamente qué hacer despues de un registro, podemos levantar el evento `UsuarioRegistrado` y luego finalizar el proceso de registro. El código que envía el correo y el código que redimensiona la imagen de avatar se adjuntan al evento y por lo tanto serán ejecutados cuando el evento se dispara. Si alguna vez se necesita hacer más cosas en el proceso de registro, puedes añadir distintos gestores de eventos sin necesidad de modificar `RegistroService`.

source: For raising events and attaching handlers to these events, Yii has a special service called event dispatcher. It's available from [yiisoft/event-dispatcher package](https://github.com/yiisoft/event-dispatcher).
es: Para levantar eventos y acoplar gestores a esos eventos, Yii tiene un servicio especial llamado despachador de eventos. Se encuentra disponible en el [paquete yiisoft/event-dispatcher](https://github.com/yiisoft/event-dispatcher).

source: Event Handlers <span id="event-handlers"></span>
es: Gestores de Eventos <span id="event-handlers"></span>

source: The signature of an event handler is:
es: La firma de un gestor de eventos es:

source: function (EventClass $event) { // handle it }
es: function (EventClass $event) { // gestionar evento }

source: Attaching event handlers <span id="attaching-event-handlers"></span>
es: Acoplar Gestores de Eventos <span id="attaching-event-handlers"></span>

source: You can attach a handler to an event like the following:
es: Puedes acoplar un gestor a un evento como se demuestra a continuación:

source: use Yiisoft\EventDispatcher\Provider\Provider; final readonly class WelcomeEmailSender { public function __construct(Provider $provider) { $provider->attach([$this, 'handleUserSignup']); } public function handleUserSignup(UserSignedUp $event) { // handle it } }
es: use Yiisoft\EventDispatcher\Provider\Provider; class WelcomeEmailSender { public function __construct(Provider $provider) { $provider->attach([$this, 'handleUserSignup']); } public function handleUserSignup(UserSignedUp $event) { // gestionar evento } }

source: The `attach()` method is accepting a callback. Based on the type of this callback argument, the event type is determined.
es: El método `attach()` acepta funciones de retorno (callbacks). Dependiendo del argumento de la función de retorno se determina el tipo de evento.

source: Event handlers order
es: Orden de Gestores de Eventos

source: You may attach one or more handlers to a single event. When an event is triggered, the attached handlers will be called in the order that they were attached to the event. In case an event implements `Psr\EventDispatcher\StoppableEventInterface`, event handler can stop executing the rest of the handlers that follow it if `isPropagationStopped()` returns `true`.
es: Se puede acoplar uno o más gestores a un único evento. Cuando se lanza un evento, se ejecutarán los gestores adjuntos en el orden que se hayan añadido al evento. En el caso que un evento implemente `Psr\EventDispatcher\StoppableEventInterface`, el gestor de eventos puede detener la ejecución del resto de los gestores que le siguen si `isPropagationStopped()` devuelve `true`.

source: In general, it's better not to rely on the order of event handlers.
es: En general, lo mejor es no depender del orden de los gestores de eventos.

source: Raising events <span id="raising-events"></span>
es: Lanzamiento de Eventos <span id="raising-events"></span>

source: Events are raised like the following:
es: Los eventos se lanzan de la siguiente forma:

source: First, you create an event supplying it with data that may be useful for handlers. Then you dispatch the event.
es: Primero, estamos creando un evento entregandole datos que pueden ser útiles para los gestores. Luego, se lanza el evento.

source: The event class itself may look like the following:
es: La clase del evento en sí se podría ver como esto:

source: Events hierarchy
es: Jerarquía de Eventos

source: Events don't have any name or wildcard matching on purpose. Event class names and class/interface hierarchy and composition could be used to achieve great flexibility:
es: Los eventos no tienen nombre o wildcard matching por una razón. Los nombres de clases de los eventos y la jerarquía de clases/interfaces y composición se puede utilizar para obtener mayor flexibilidad:

source: With the interface, you can listen to all document-related events:
es: Para que la interface de arriba escuche todos los eventos relacionados con documentos, se puede realizar de la siguiente forma:

source: Detaching event handlers <span id="detaching-event-handlers"></span>
es: Desacoplar Gestores de Eventos <span id="detaching-event-handlers"></span>

source: To detach a handler from an event you can call `detach()` method:
es: Para desacoplar un gestor de eventos puedes llamar al método `detach()`:
